app/Controllers/Admin.php

SELECT `arboles`.*, `especies`.`nombre_comercial` AS `especie`
FROM `arboles`
LEFT JOIN `especies` ON `especies`.`id` = `arboles`.`especie_id`
---
    public function listTrees()
    {
        $treeModel = new Tree();

        $data['trees'] = $treeModel->select('arboles.*, especies.nombre_comercial AS especie')
            ->join('especies', 'especies.id = arboles.especie_id', 'left')
            ->findAll();

SELECT `arboles`.*, `especies`.`nombre_comercial` AS `especie`
FROM `arboles`
LEFT JOIN `especies` ON `especies`.`id` = `arboles`.`especie_id`
WHERE `arboles`.`amigo_id` = '12'
---
    public function viewArbolesAmigo($amigo_id)
    {
        $treeModel = new \App\Models\Tree();

        // Obtener todos los árboles relacionados con el amigo junto con el nombre de la especie
        $data['arboles'] = $treeModel->select('arboles.*, especies.nombre_comercial AS especie')
            ->join('especies', 'especies.id = arboles.especie_id', 'left')
            ->where('arboles.amigo_id', $amigo_id)
            ->findAll();

INSERT INTO `historial_arboles` (`arbol_id`, `fecha`, `tamano`, `foto`) VALUES ('3', '2024-12-05 03:29:30', 'tttt', '1733369370_fd98ff9a40512ff5ffa9.jpg')
---
    public function saveHistorial($arbol_id)
    {
        // Verifica el valor de $arbol_id
        if (!$arbol_id) {
            return redirect()->back()->with('error', 'ID del árbol no válido.');
        }

        $historialModel = new \App\Models\HistorialArboles();

        if ($foto = $this->request->getFile('foto')) {
            if ($foto->isValid() && !$foto->hasMoved()) {
                $newName = $foto->getRandomName();
                $foto->move('uploads', $newName);

                $historialModel->insert([
                    'arbol_id' => $arbol_id, // Asegúrate de que este valor sea correcto
                    'fecha'    => date('Y-m-d H:i:s'),
                    'tamano'   => $this->request->getPost('tamano'),
                    'foto'     => $newName,
                ]);

SELECT *
FROM `historial_arboles`
WHERE `arbol_id` = '3'
---
    public function viewHistorial($arbol_id)
    {
        $historialModel = new \App\Models\HistorialArboles();

        // Obtener solo el historial relacionado con el árbol especificado
        $data['historial'] = $historialModel->where('arbol_id', $arbol_id)->findAll();