app/Controllers/Amigo.php

    public function listAvailableTrees()
    {
        $treeModel = new Tree();

        // Obtener árboles disponibles
        $data['arboles'] = $treeModel->where('estado', 'disponible')->findAll();
---
SELECT *
FROM `arboles`
WHERE `estado` = 'disponible'