app/Controllers/Amigo.php

    public function listAvailableTrees()
    {
        $treeModel = new \App\Models\Tree();

        // Obtener árboles disponibles junto con el nombre comercial de la especie
        $data['arboles'] = $treeModel->select('arboles.*, especies.nombre_comercial AS especie')
            ->join('especies', 'especies.id = arboles.especie_id', 'left')
            ->where('arboles.estado', 'disponible')
            ->findAll();
---
SELECT `arboles`.*, `especies`.`nombre_comercial` AS `especie`
FROM `arboles`
LEFT JOIN `especies` ON `especies`.`id` = `arboles`.`especie_id`
WHERE `arboles`.`estado` = 'disponible'

    public function buyTree($tree_id)
    {
        $treeModel = new \App\Models\Tree();

        // Obtener el árbol junto con el nombre de la especie
        $data['arbol'] = $treeModel->select('arboles.*, especies.nombre_comercial AS especie_nombre')
            ->join('especies', 'arboles.especie_id = especies.id')
            ->where('arboles.id', $tree_id)
            ->first();
---
SELECT `arboles`.*, `especies`.`nombre_comercial` AS `especie_nombre`
FROM `arboles`
JOIN `especies` ON `arboles`.`especie_id` = `especies`.`id`
WHERE `arboles`.`id` = '2'
 LIMIT 1

    public function listMyTrees()
    {
        $treeModel = new \App\Models\Tree();
        $speciesModel = new \App\Models\Species();

        $userId = session()->get('user')['id'];

        // Obtener los árboles con el nombre de la especie
        $arboles = $treeModel->where('amigo_id', $userId)
            ->select('arboles.*, especies.nombre_comercial AS especie_nombre')
            ->join('especies', 'arboles.especie_id = especies.id')
            ->findAll();
---
SELECT `arboles`.*, `especies`.`nombre_comercial` AS `especie_nombre`
FROM `arboles`
JOIN `especies` ON `arboles`.`especie_id` = `especies`.`id`
WHERE `amigo_id` = '12'

    public function viewTree($tree_id)
    {
        $treeModel = new \App\Models\Tree();

        // Obtener el árbol con el nombre de la especie y verificar que pertenezca al usuario actual
        $tree = $treeModel->select('arboles.*, especies.nombre_comercial AS especie_nombre')
            ->join('especies', 'arboles.especie_id = especies.id')
            ->where('arboles.id', $tree_id)
            ->where('arboles.amigo_id', session('user')['id'])
            ->first();
---
SELECT `arboles`.*, `especies`.`nombre_comercial` AS `especie_nombre`
FROM `arboles`
JOIN `especies` ON `arboles`.`especie_id` = `especies`.`id`
WHERE `arboles`.`id` = '5'
AND `arboles`.`amigo_id` = '12'
 LIMIT 1