app/Controllers/Operador.php

    public function viewArbolesAmigoOperator($amigo_id)
    {
        $treeModel = new \App\Models\Tree();

        // Obtener todos los árboles relacionados con el amigo junto con el nombre de la especie
        $data['arboles'] = $treeModel->select('arboles.*, especies.nombre_comercial AS especie')
            ->join('especies', 'especies.id = arboles.especie_id', 'left')
            ->where('arboles.amigo_id', $amigo_id)
            ->findAll();
---
SELECT `arboles`.*, `especies`.`nombre_comercial` AS `especie`
FROM `arboles`
LEFT JOIN `especies` ON `especies`.`id` = `arboles`.`especie_id`
WHERE `arboles`.`amigo_id` = '5'

    public function viewHistorial($arbol_id)
    {
        $historialModel = new \App\Models\HistorialArboles();

        // Obtener solo el historial relacionado con el árbol especificado
        $data['historial'] = $historialModel->where('arbol_id', $arbol_id)->findAll();
---
SELECT *
FROM `historial_arboles`
WHERE `arbol_id` = '1'